{"id":668,"date":"2020-11-12T08:08:05","date_gmt":"2020-11-12T08:08:05","guid":{"rendered":"http:\/\/icdm2021.blogs.auckland.ac.nz\/?page_id=668"},"modified":"2021-06-08T07:25:00","modified_gmt":"2021-06-08T07:25:00","slug":"cfp","status":"publish","type":"page","link":"https:\/\/icdm2021.auckland.ac.nz\/cfp\/","title":{"rendered":"Call for Papers"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; fullwidth=&#8221;on&#8221; _builder_version=&#8221;4.0.11&#8243; background_color=&#8221;rgba(0,0,0,0)&#8221;][et_pb_fullwidth_header title=&#8221;@ET-DC@eyJkeW5hbWljIjp0cnVlLCJjb250ZW50IjoicG9zdF90aXRsZSIsInNldHRpbmdzIjp7ImJlZm9yZSI6IiIsImFmdGVyIjoiIn19@&#8221; _builder_version=&#8221;4.6.0&#8243; _dynamic_attributes=&#8221;title&#8221; title_text_align=&#8221;center&#8221; subhead_text_align=&#8221;center&#8221; background_color=&#8221;rgba(0,0,0,0)&#8221; background_layout=&#8221;light&#8221; custom_padding_tablet=&#8221;&#8221; custom_padding_phone=&#8221;10px||10px||false|false&#8221; custom_padding_last_edited=&#8221;on|phone&#8221; title_font_size_tablet=&#8221;28px&#8221; title_font_size_phone=&#8221;22px&#8221; title_font_size_last_edited=&#8221;on|phone&#8221;][\/et_pb_fullwidth_header][\/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.6.0&#8243; custom_padding=&#8221;0px||0px||false|false&#8221; z_index_tablet=&#8221;500&#8243; box_shadow_horizontal_tablet=&#8221;0px&#8221; box_shadow_vertical_tablet=&#8221;0px&#8221; box_shadow_blur_tablet=&#8221;40px&#8221; box_shadow_spread_tablet=&#8221;0px&#8221;][et_pb_row _builder_version=&#8221;4.0.11&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.11&#8243;][et_pb_text _builder_version=&#8221;4.8.2&#8243; hover_enabled=&#8221;0&#8243; sticky_enabled=&#8221;0&#8243;]<\/p>\n<h4><strong>Aims and Scope<\/strong><\/h4>\n<p>The IEEE International Conference on Data Mining (ICDM) has established itself as the world’s premier research conference in data mining. It provides an international forum for presentation of original research results, as well as exchange and dissemination of innovative and practical development experiences. The conference covers all aspects of data mining, including algorithms, software, systems, and applications. ICDM draws researchers, application developers, and practitioners from a wide range of data mining related areas such as big data, deep learning, pattern recognition, statistical and machine learning，databases, data warehousing, data visualization, knowledge-based systems, and high-performance computing. By promoting novel, high-quality research findings, and innovative solutions to challenging data mining problems, the conference seeks to advance the state-of-the-art in data mining.<\/p>\n<p>&nbsp;<\/p>\n<h4><strong>Topics of Interest<\/strong><\/h4>\n<p>Topics of interest include, but are not limited to:<br \/>* Foundations, algorithms, models and theory of data mining, including big data mining.<br \/>* Deep learning and statistical methods for data mining.<br \/>* Mining from heterogeneous data sources, including text, semi-structured, spatio-temporal, streaming, graph, web, and multimedia data.<br \/>* Data mining systems and platforms, and their efficiency, scalability, security and privacy.<br \/>* Data mining for modelling, visualization, personalization, and recommendation.<br \/>* Data mining for cyber-physical systems and complex, time-evolving networks.<br \/>* Applications of data mining in social sciences, physical sciences, engineering, life sciences, web, marketing, finance, precision medicine, health informatics, and other domains.<\/p>\n<p>We particularly encourage submissions in emerging topics of high importance such as ethical data analytics, automated data analytics, data-driven reasoning, interpretable modeling, modeling with evolving environments, multi-modal data mining, and heterogeneous data integration and mining.<\/p>\n<p>&nbsp;<\/p>\n<h4><strong>Submission Guidelines<\/strong><\/h4>\n<p>Authors are invited to submit original papers, which have not been published elsewhere and which are not currently under consideration for another journal, conference or workshop.<\/p>\n<p>Paper submissions should be limited to a maximum of ten (10) pages, in the IEEE 2-column format (<a href=\"https:\/\/www.ieee.org\/conferences\/publishing\/templates.html\">https:\/\/www.ieee.org\/conferences\/publishing\/templates.html<\/a>), including the bibliography and any possible appendices. Submissions longer than 10 pages will be rejected without review. All submissions will be triple-blind reviewed by the Program Committee on the basis of technical quality, relevance to scope of the conference, originality, significance, and clarity. The following sections give further information for authors.<\/p>\n<p>&nbsp;<\/p>\n<h5><strong><em>Triple-blind submission guidelines<\/em><\/strong><\/h5>\n<p>Since 2011, ICDM has imposed a triple-blind submission and review policy for all submissions. Authors must hence not use identifying information in the text of the paper and bibliographies must be referenced to preserve anonymity. Any papers available on the Web (including arXiv) no longer qualify for ICDM submissions, as their author information is already public.<\/p>\n<p>&nbsp;<\/p>\n<h5><em><strong>What is triple-blind reviewing?<\/strong><\/em><\/h5>\n<p>The traditional blind paper submission hides the referee names from the authors, and the double-blind paper submission also hides the author names from the referees. The triple-blind reviewing further hides the referee names among referees during paper discussions before their acceptance decisions. The names of authors and referees remain known only to the PC Co-Chairs, and the author names are disclosed only after the ranking and acceptance of submissions are finalized. It is imperative that all authors of ICDM submissions conceal their identity and affiliation information in their paper submissions. It does not suffice to simply remove the author names and affiliations from the first page, but also in the content of each paper submission.<\/p>\n<p>&nbsp;<\/p>\n<h5><strong><em>How to prepare your submissions<\/em><\/strong><\/h5>\n<p>The authors shall omit their names from the submission. For formatting templates with author and institution information, simply replace all these information items in the template by “Anonymous”.<\/p>\n<p>In the submission, the authors should refer to their own prior work like the prior work of any other author, and include all relevant citations. This can be done either by referring to their prior work in the third person or referencing papers generically. For example, if your name is Smith and you have worked on clustering, instead of saying “We extend our earlier work on distance-based clustering (Smith 2005),” you might say “We extend Smith’s earlier work (Smith 2005) on distance-based clustering.” The authors shall exclude citations to their own work which is not fundamental to understanding the paper, including prior versions (e.g., technical reports, unpublished internal documents) of the submitted paper. Hence, do not write: “In our previous work [3]” as it reveals that citation 3 is written by the current authors. The authors shall remove mention of funding sources, personal acknowledgments, and other such auxiliary information that could be related to their identities. These can be reinstituted in the camera-ready copy once the paper is accepted for publication. The authors shall make statements on well-known or unique systems that identify an author, as vague in respect to identifying the authors as possible. The submitted files should be named with care to ensure that author anonymity is not compromised by the file names. For example, do not name your submission “Smith.pdf”, instead give it a name that is descriptive of the title of your paper, such as “ANewApproachtoClustering.pdf” (or a shorter version of the same).<\/p>\n<p>Algorithms and resources used in a paper should be described as completely as possible to allow reproducibility. This includes experimental methodology, empirical evaluations, and results. Authors are strongly encouraged to make their code and data publicly available whenever possible. In addition, authors are strongly encouraged to also report, whenever possible, results for their methods on publicly available datasets.<\/p>\n<p>Accepted papers will be published in the conference proceedings by the IEEE Computer Society Press. All manuscripts are submitted as full papers and are reviewed based on their scientific merit. There is no separate abstract submission step. There are no separate industrial, application, short paper or poster tracks during submission. Manuscripts must be submitted electronically in the online submission system (<a href=\"https:\/\/www.wi-lab.com\/cyberchair\/2021\/icdm21\/scripts\/submit.php?subarea=DM\">https:\/\/www.wi-lab.com\/cyberchair\/2021\/icdm21\/scripts\/submit.php?subarea=DM<\/a>). We do not accept email submissions.<\/p>\n<h5> <\/h5>\n<h5><strong><em>Reproducibility guidelines<\/em><\/strong><\/h5>\n<p>Authors must complete a reproducibility checklist at the time of paper submission (the questions in PDF format)[<a href=\"https:\/\/www.cs.mcgill.ca\/~jpineau\/ReproducibilityChecklist-v2.0.pdf\">https:\/\/www.cs.mcgill.ca\/~jpineau\/ReproducibilityChecklist-v2.0.pdf<\/a>]. Authors are strongly recommended to start thinking about these questions already when writing the paper and to fill in the questionnaire well in time before the submission deadline. These responses will become part of each paper submission and will be shared with the area chairs and\/or reviewers to help them in the evaluation process. Authors are encouraged to include in their papers all technical details (proofs, descriptions of assumptions, algorithm pseudocode) as well as information about each reproducibility criterion, as appropriate. Reviewers will be asked to assess the degree to which the results reported in a paper are reproducible, and this assessment will be weighed when making final decisions about each paper.<\/p>\n<p>&nbsp;<\/p>\n<h4><strong>Best Paper Awards<\/strong><\/h4>\n<p>Awards will be conferred at the conference to the authors of the best paper and the best student paper. A selected number of best papers will be invited for possible inclusion, in an expanded and revised form, in the Knowledge and Information Systems journal (<a href=\"http:\/\/kais.bigke.org\/\">http:\/\/kais.bigke.org\/<\/a>) published by Springer.<\/p>\n<p>&nbsp;<\/p>\n<h4><strong>Attendance<\/strong><\/h4>\n<p>ICDM is a premier forum for presenting and discussing current research in data mining. Therefore, at least one author of each accepted paper must complete the conference registration and present the paper at the conference, in order for the paper to be included in the proceedings and conference program. The exact format of the conference (in person, online, or hybrid) will be decided later.<\/p>\n<p>&nbsp;<\/p>\n<h4><strong>Important Dates<\/strong><\/h4>\n<p>**All times are at 11:59PM Pacific Daylight Time**<\/p>\n<ul>\n<li>Full paper submissions: 11 June 2021<\/li>\n<li>Notifications: 31 August 2021<\/li>\n<li>Camera-ready copy submissions: 1 October 2021<\/li>\n<li>Conference starts: 7 December 2021<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h4><strong>Contact<\/strong><\/h4>\n<p>For queries regarding this call, please contact: <a href=\"mailto:icdm21pc.chairs@gmail.com\">icdm21pc.chairs@gmail.com<\/a><\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Aims and Scope The IEEE International Conference on Data Mining (ICDM) has established itself as the world’s premier research conference in data mining. It provides an international forum for presentation of original research results, as well as exchange and dissemination of innovative and practical development experiences. The conference covers all aspects of data mining, including [&hellip;]<\/p>\n","protected":false},"author":5078,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"_links":{"self":[{"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/pages\/668"}],"collection":[{"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/users\/5078"}],"replies":[{"embeddable":true,"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/comments?post=668"}],"version-history":[{"count":14,"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/pages\/668\/revisions"}],"predecessor-version":[{"id":997,"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/pages\/668\/revisions\/997"}],"wp:attachment":[{"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/media?parent=668"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}