{"id":998,"date":"2021-06-09T03:45:25","date_gmt":"2021-06-09T03:45:25","guid":{"rendered":"http:\/\/icdm2021.blogs.auckland.ac.nz\/?page_id=998"},"modified":"2021-08-12T04:46:21","modified_gmt":"2021-08-12T04:46:21","slug":"keynotes","status":"publish","type":"page","link":"https:\/\/icdm2021.auckland.ac.nz\/keynotes\/","title":{"rendered":"Keynotes"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; fullwidth=&#8221;on&#8221; _builder_version=&#8221;4.0.11&#8243; background_color=&#8221;rgba(0,0,0,0)&#8221;][et_pb_fullwidth_header title=&#8221;@ET-DC@eyJkeW5hbWljIjp0cnVlLCJjb250ZW50IjoicG9zdF90aXRsZSIsInNldHRpbmdzIjp7ImJlZm9yZSI6IiIsImFmdGVyIjoiIn19@&#8221; _builder_version=&#8221;4.6.0&#8243; _dynamic_attributes=&#8221;title&#8221; title_text_align=&#8221;center&#8221; subhead_text_align=&#8221;center&#8221; background_color=&#8221;rgba(0,0,0,0)&#8221; background_layout=&#8221;light&#8221; custom_padding_tablet=&#8221;&#8221; custom_padding_phone=&#8221;10px||10px||false|false&#8221; custom_padding_last_edited=&#8221;on|phone&#8221; title_font_size_tablet=&#8221;28px&#8221; title_font_size_phone=&#8221;22px&#8221; title_font_size_last_edited=&#8221;on|phone&#8221;][\/et_pb_fullwidth_header][\/et_pb_section][et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.6.0&#8243; custom_padding=&#8221;0px||0px||false|false&#8221; z_index_tablet=&#8221;500&#8243; box_shadow_horizontal_tablet=&#8221;0px&#8221; box_shadow_vertical_tablet=&#8221;0px&#8221; box_shadow_blur_tablet=&#8221;40px&#8221; box_shadow_spread_tablet=&#8221;0px&#8221;][et_pb_row _builder_version=&#8221;4.0.11&#8243; locked=&#8221;off&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.11&#8243;][et_pb_team_member name=&#8221;Jian Pei&#8221; position=&#8221;Simon Fraser University&#8221; image_url=&#8221;https:\/\/icdm2021.auckland.ac.nz\/files\/2021\/06\/jianpei_round-1.jpg&#8221; _builder_version=&#8221;4.8.2&#8243; _module_preset=&#8221;default&#8221;]<\/p>\n<p>&nbsp;<\/p>\n<p><strong><span style=\"font-size: +2;\">Towards Trustworthy Data Science: Interpretability, Fairness and Marketplaces<\/span><\/strong><\/p>\n<p><strong>Abstract<\/strong><\/p>\n<p>We believe data science and AI will change the world.  No matter how smart and powerful an AI model we can build, the ultimate testimony of the success of data science and AI is users&#8217; trust.  How can we build trustworthy data science?  At the level of user-model interaction, how can we convince users that a data analytic result is trustworthy?  At the level of group-wise collaboration for data science and AI, how can we ensure that the parties and their contributions are recognized fairly, and establish trust between the outcome (e.g., a model built) of the group collaboration and the external users?   At the level of data science participant eco-systems, how can we effectively and efficiently connect many participants of various roles and facilitate the connection among supplies and demands of data and models?<\/p>\n<p>In this talk, I will brainstorm possible directions to the above questions in the context of an end-to-end data science pipeline.  To strengthen trustworthy interactions between models and users, I will advocate exact and consistent interpretation of machine learning models.  Our recent results show that exact and consistent interpretations are not just theoretically feasible, but also practical even for API-based AI services.  To build trust in collaboration among multiple participants in coalition, I will review some progress in ensuring fairness in federated learning, including fair assessment of contributions and fairness enforcement in collaboration outcome.  Last, to address the need of trustworthy data science eco-systems, I will review some latest efforts in building data and model marketplaces and preserving fairness and privacy.  Through reflection I will discuss some challenges and opportunities in building trustworthy data science for possible future work.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bio<\/strong><\/p>\n<p>Jian Pei is a Professor in the School of Computing Science at Simon Fraser University. He is a well known leading researcher in the general areas of data science, big data, data mining, and database systems. His expertise is on developing effective and efficient data analysis techniques for novel data intensive applications, and transferring his research results to products and business practice. He is recognized as a Fellow of the Royal Society of Canada (Canada&#8217;s national academy), the Canadian Academy of Engineering, the Association of Computing Machinery (ACM) and  the Institute of Electrical and Electronics Engineers (IEEE). He is one of the most cited authors in data mining, database systems, and information retrieval. Since 2000, he has published one textbook, two monographs and over 300 research papers in refereed journals and conferences, which have been cited extensively by others. His research has generated remarkable impact substantially beyond academia. For example, his algorithms have been adopted by industry in production and popular open source software suites. Jian Pei also demonstrated outstanding professional leadership in many academic organizations and activities. He was the editor-in-chief of the IEEE Transactions of Knowledge and Data Engineering (TKDE) in 2013-16, the chair of the Special Interest Group on Knowledge Discovery in Data (SIGKDD) of the Association for Computing Machinery (ACM) in 2017-2021, and a general co-chair or program committee co-chair of many premier conferences.  He maintains a wide spectrum of industry relations with both global and local industry partners. He is an active consultant and coach for industry on enterprise data strategies, healthcare informatics, network security intelligence, computational finance, and smart retail.  He received many prestigious awards, including the 2017 ACM SIGKDD Innovation Award, the 2015 ACM SIGKDD Service Award, the 2014 IEEE ICDM Research Contributions Award, the British Columbia Innovation Council 2005 Young Innovator Award, an NSERC 2008 Discovery Accelerator Supplements Award (100 awards cross the whole country), an IBM Faculty Award (2006), a KDD Best Application Paper Award (2008), an ICDE Influential Paper Award (2018), a PAKDD Best Paper Award (2014), a PAKDD Most Influential Paper Award (2009), and an IEEE Outstanding Paper Award (2007).<\/p>\n<p>&nbsp;<\/p>\n<p>[\/et_pb_team_member][\/et_pb_column][\/et_pb_row][et_pb_row _builder_version=&#8221;4.0.11&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.11&#8243;][et_pb_team_member name=&#8221;Masashi Sugiyama&#8221; position=&#8221;RIKEN Center for Advanced Intelligence Project \/ The University of Tokyo&#8221; image_url=&#8221;https:\/\/icdm2021.auckland.ac.nz\/files\/2021\/06\/masashi_round-e1624422852467.jpg&#8221; _builder_version=&#8221;4.8.2&#8243; _module_preset=&#8221;default&#8221;]&nbsp;<\/p>\n<p><strong><span style=\"font-size: +2;\">Towards Robust Machine Learning: Weak Supervision, Noisy Labels, and Beyond<\/span><\/strong><\/p>\n<p><strong>Abstract<\/strong><\/p>\n<p>When machine learning systems are trained and deployed in the real world, we face various types of uncertainty. For example, training data at hand may contain insufficient information, label noise, and bias. In this talk, I will give an overview of our recent advances in robust machine learning.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bio<\/strong><\/p>\n<p>Masashi Sugiyama received Doctor of Engineering in Computer Science from Tokyo Institute of Technology, Japan in 2001. Experiencing Assistant Professor and Associate Professor at Tokyo Institute of Technology, he became Professor at the University of Tokyo in 2014. Since 2016, he has been concurrently serving as Director of RIKEN Center for Advanced Intelligence Project. His research interests include theories and algorithms of machine learning. He received the Japan Academy Medal in 2017 for his series of machine learning research. He coauthored Machine Learning in Non-Stationary Environments (MIT Press, 2012), Density Ratio Estimation in Machine Learning (Cambridge University Press, 2012), Statistical Reinforcement Learning (Chapman and Hall, 2015), Introduction to Statistical Machine Learning (Morgan Kaufmann, 2015), and Machine Learning from Weak Supervision (MIT Press, to appear).<\/p>\n<p>&nbsp;[\/et_pb_team_member][\/et_pb_column][\/et_pb_row][et_pb_row _builder_version=&#8221;4.0.11&#8243; locked=&#8221;off&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.0.11&#8243;][et_pb_team_member name=&#8221;Svetha Venkatesh&#8221; position=&#8221;Deakin University’s Applied Artificial Intelligence Institute (A²I²)&#8221; image_url=&#8221;https:\/\/icdm2021.auckland.ac.nz\/files\/2021\/08\/svetha.jpg&#8221; _builder_version=&#8221;4.9.6&#8243; _module_preset=&#8221;default&#8221; hover_enabled=&#8221;0&#8243; title_text=&#8221;svetha&#8221; sticky_enabled=&#8221;0&#8243;]<\/p>\n<p>​<\/p>\n<p><strong>Sample Efficient AI with Applications in Health Care and Advanced Manufacturing<\/strong><\/p>\n<p><strong>Abstract<\/strong><\/p>\n<p>From Guglielmo Marconi who developed the radio telegraph to the Wright brothers who invented flying machines, curiosity driven experimentation has powered human innovation. Such experimental optimisation remains an integral part of the Scientific Method. This time-honoured method needs a step change to accelerate scientific innovation because this iterative method quickly hits limits.<\/p>\n<p>To speed-up innovation, it is imperative to expand the capability of experimental optimisation and improve its efficiency. This talk will demonstrate how sample efficient AI can be used to deliver this acceleration in experimental design. I will discuss how the methods can be applied widely, focusing on health and advanced manufacturing particularly in settings where data is scare and experimentation is expensive. In healthcare, I show how these methods can accelerate the design of clinical\/health trials to efficiently determine the optimal strategy. In advanced manufacturing, I will show how it can be applied broadly from inventing new materials and alloys to accelerating industrial processes.<\/p>\n<p>The second part of the talk will focus on the new machine learning innovations that have been formulated and solved to advance experimental design. These include incorporating experimental design constraints such as process constraints, transferring knowledge from pervious experiments or experimenter “hunches”, and high dimensional Bayesian optimisation so that the number of experimental control variables can be increased.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bio<\/strong><\/p>\n<p>Svetha Venkatesh is an ARC Australian Laureate Fellow, Alfred Deakin Professor and a co- Director of Applied Artificial Intelligence Institute (A2I2) at Deakin University. She was elected a <em>Fellow of the International Association of Pattern Recognition<\/em> in 2004 for contributions to formulation and extraction of semantics in multimedia data, a <em>Fellow of the Australian Academy of Technological Sciences and Engineering<\/em> in 2006, and a <em>Fellow of the Australian Academy of Science<\/em> in 2021 for ground-breaking research and contributions that have had clear impact. In 2017, Professor Venkatesh was appointed an Australian Laureate Fellow, the highest individual award the Australian Research Council can bestow.<\/p>\n<p>Professor Venkatesh and her team have tackled a wide range of problems of societal significance, including the critical areas of autism, security and aged care. The outcomes have impacted the community and evolved into publications, patents, tools and spin-off companies. This includes 650+ publications, three full patents, one start-up company (iCetana) and two significant products (TOBY Playpad, Virtual Observer).<\/p>\n<p>Professor Venkatesh has tackled complex pattern recognition tasks by drawing inspiration and models from widely diverse disciplines, integrating them into rigorous computational models and innovative algorithms. Her main contributions have been in the development of theoretical frameworks and novel applications for analysing large scale, multimedia data. This includes development of several Bayesian parametric and non-parametric models, solving fundamental problems in processing multiple channel, multi-modal temporal and spatial data.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>[\/et_pb_team_member][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Towards Trustworthy Data Science: Interpretability, Fairness and Marketplaces Abstract We believe data science and AI will change the world.  No matter how smart and powerful an AI model we can build, the ultimate testimony of the success of data science and AI is users&#8217; trust.  How can we build trustworthy data science?  At the level [&hellip;]<\/p>\n","protected":false},"author":5078,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"_links":{"self":[{"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/pages\/998"}],"collection":[{"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/users\/5078"}],"replies":[{"embeddable":true,"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/comments?post=998"}],"version-history":[{"count":26,"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/pages\/998\/revisions"}],"predecessor-version":[{"id":1185,"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/pages\/998\/revisions\/1185"}],"wp:attachment":[{"href":"https:\/\/icdm2021.auckland.ac.nz\/wp-json\/wp\/v2\/media?parent=998"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}